Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ06GS102.h
#define _RPOR6_RP13R1_POSITION                   0x00000009
#define _RPOR6_RP13R1_MASK                       0x00000200
#define _RPOR6_RP13R1_LENGTH                     0x00000001

#define _RPOR6_RP13R2_POSITION                   0x0000000A
#define _RPOR6_RP13R2_MASK                       0x00000400
#define _RPOR6_RP13R2_LENGTH                     0x00000001

#define _RPOR6_RP13R3_POSITION                   0x0000000B
#define _RPOR6_RP13R3_MASK                       0x00000800
#define _RPOR6_RP13R3_LENGTH                     0x00000001

#define _RPOR6_RP13R4_POSITION                   0x0000000C
#define _RPOR6_RP13R4_MASK                       0x00001000
#define _RPOR6_RP13R4_LENGTH                     0x00000001

#define _RPOR6_RP13R5_POSITION                   0x0000000D
#define _RPOR6_RP13R5_MASK                       0x00002000
#define _RPOR6_RP13R5_LENGTH                     0x00000001

#define _RPOR7_RP14R_POSITION                    0x00000000
#define _RPOR7_RP14R_MASK                        0x0000003F
#define _RPOR7_RP14R_LENGTH                      0x00000006

#define _RPOR7_RP15R_POSITION                    0x00000008
#define _RPOR7_RP15R_MASK                        0x00003F00
#define _RPOR7_RP15R_LENGTH                      0x00000006

#define _RPOR7_RP14R0_POSITION                   0x00000000
#define _RPOR7_RP14R0_MASK                       0x00000001
#define _RPOR7_RP14R0_LENGTH                     0x00000001

#define _RPOR7_RP14R1_POSITION                   0x00000001
#define _RPOR7_RP14R1_MASK                       0x00000002
#define _RPOR7_RP14R1_LENGTH                     0x00000001

#define _RPOR7_RP14R2_POSITION                   0x00000002
#define _RPOR7_RP14R2_MASK                       0x00000004
#define _RPOR7_RP14R2_LENGTH                     0x00000001

#define _RPOR7_RP14R3_POSITION                   0x00000003
#define _RPOR7_RP14R3_MASK                       0x00000008
#define _RPOR7_RP14R3_LENGTH                     0x00000001

#define _RPOR7_RP14R4_POSITION                   0x00000004
#define _RPOR7_RP14R4_MASK                       0x00000010
#define _RPOR7_RP14R4_LENGTH                     0x00000001

#define _RPOR7_RP14R5_POSITION                   0x00000005
#define _RPOR7_RP14R5_MASK                       0x00000020
#define _RPOR7_RP14R5_LENGTH                     0x00000001

#define _RPOR7_RP15R0_POSITION                   0x00000008
#define _RPOR7_RP15R0_MASK                       0x00000100
#define _RPOR7_RP15R0_LENGTH                     0x00000001

#define _RPOR7_RP15R1_POSITION                   0x00000009
#define _RPOR7_RP15R1_MASK                       0x00000200
#define _RPOR7_RP15R1_LENGTH                     0x00000001

#define _RPOR7_RP15R2_POSITION                   0x0000000A
#define _RPOR7_RP15R2_MASK                       0x00000400
#define _RPOR7_RP15R2_LENGTH                     0x00000001

#define _RPOR7_RP15R3_POSITION                   0x0000000B
#define _RPOR7_RP15R3_MASK                       0x00000800
#define _RPOR7_RP15R3_LENGTH                     0x00000001

#define _RPOR7_RP15R4_POSITION                   0x0000000C
#define _RPOR7_RP15R4_MASK                       0x00001000
#define _RPOR7_RP15R4_LENGTH                     0x00000001

#define _RPOR7_RP15R5_POSITION                   0x0000000D
#define _RPOR7_RP15R5_MASK                       0x00002000
#define _RPOR7_RP15R5_LENGTH                     0x00000001

#define _RPOR16_RP32R_POSITION                   0x00000000
#define _RPOR16_RP32R_MASK                       0x0000003F
#define _RPOR16_RP32R_LENGTH                     0x00000006

#define _RPOR16_RP33R_POSITION                   0x00000008
#define _RPOR16_RP33R_MASK                       0x00003F00
#define _RPOR16_RP33R_LENGTH                     0x00000006

#define _RPOR16_RP32R0_POSITION                  0x00000000
#define _RPOR16_RP32R0_MASK                      0x00000001
#define _RPOR16_RP32R0_LENGTH                    0x00000001

#define _RPOR16_RP32R1_POSITION                  0x00000001
#define _RPOR16_RP32R1_MASK                      0x00000002
#define _RPOR16_RP32R1_LENGTH                    0x00000001

#define _RPOR16_RP32R2_POSITION                  0x00000002
#define _RPOR16_RP32R2_MASK                      0x00000004
#define _RPOR16_RP32R2_LENGTH                    0x00000001

#define _RPOR16_RP32R3_POSITION                  0x00000003
#define _RPOR16_RP32R3_MASK                      0x00000008
#define _RPOR16_RP32R3_LENGTH                    0x00000001

#define _RPOR16_RP32R4_POSITION                  0x00000004
#define _RPOR16_RP32R4_MASK                      0x00000010
#define _RPOR16_RP32R4_LENGTH                    0x00000001

#define _RPOR16_RP32R5_POSITION                  0x00000005
#define _RPOR16_RP32R5_MASK                      0x00000020
#define _RPOR16_RP32R5_LENGTH                    0x00000001

#define _RPOR16_RP33R0_POSITION                  0x00000008
#define _RPOR16_RP33R0_MASK                      0x00000100
#define _RPOR16_RP33R0_LENGTH                    0x00000001

#define _RPOR16_RP33R1_POSITION                  0x00000009
#define _RPOR16_RP33R1_MASK                      0x00000200
#define _RPOR16_RP33R1_LENGTH                    0x00000001

#define _RPOR16_RP33R2_POSITION                  0x0000000A
#define _RPOR16_RP33R2_MASK                      0x00000400
#define _RPOR16_RP33R2_LENGTH                    0x00000001

#define _RPOR16_RP33R3_POSITION                  0x0000000B
#define _RPOR16_RP33R3_MASK                      0x00000800
#define _RPOR16_RP33R3_LENGTH                    0x00000001

#define _RPOR16_RP33R4_POSITION                  0x0000000C
#define _RPOR16_RP33R4_MASK                      0x00001000
#define _RPOR16_RP33R4_LENGTH                    0x00000001

#define _RPOR16_RP33R5_POSITION                  0x0000000D
#define _RPOR16_RP33R5_MASK                      0x00002000
#define _RPOR16_RP33R5_LENGTH                    0x00000001

#define _RPOR17_RP34R_POSITION                   0x00000000
#define _RPOR17_RP34R_MASK                       0x0000003F
#define _RPOR17_RP34R_LENGTH                     0x00000006

#define _RPOR17_RP35R_POSITION                   0x00000008
#define _RPOR17_RP35R_MASK                       0x00003F00
#define _RPOR17_RP35R_LENGTH                     0x00000006

#define _RPOR17_RP34R0_POSITION                  0x00000000
#define _RPOR17_RP34R0_MASK                      0x00000001
#define _RPOR17_RP34R0_LENGTH                    0x00000001

#define _RPOR17_RP34R1_POSITION                  0x00000001
#define _RPOR17_RP34R1_MASK                      0x00000002
#define _RPOR17_RP34R1_LENGTH                    0x00000001

#define _RPOR17_RP34R2_POSITION                  0x00000002
#define _RPOR17_RP34R2_MASK                      0x00000004
#define _RPOR17_RP34R2_LENGTH                    0x00000001

#define _RPOR17_RP34R3_POSITION                  0x00000003
#define _RPOR17_RP34R3_MASK                      0x00000008
#define _RPOR17_RP34R3_LENGTH                    0x00000001

